export function getWeatherIcon(code, isDay = true) {
    const baseUrl = "https://openweathermap.org/img/wn/";
    const time = isDay ? 'd' : 'n';

    const iconMap = {
        0: `01${time}`,
        1: `02${time}`,
        2: `03${time}`,
        3: `04${time}`,
        45: '50d',
        48: '50d',
        51: '09d',
        53: '09d',
        55: '09d',
        56: '13d',
        57: '13d',
        61: '10d',
        63: '10d',
        65: '10d',
        66: '13d',
        67: '13d',
        71: '13d',
        73: '13d',
        75: '13d',
        77: '13d',
        80: '09d',
        81: '09d',
        82: '09d',
        85: '13d',
        86: '13d',
        95: '11d',
        96: '11d',
        99: '11d'
    };

    return `${baseUrl}${iconMap[code] || `02${time}`}@2x.png`;
}

export function getWeatherDescription(code) {
    const descriptions = {
        0: 'Ясно',
        1: 'Преимущественно ясно',
        2: 'Переменная облачность',
        3: 'Пасмурно',
        45: 'Туман',
        48: 'Иней',
        51: 'Легкая морось',
        53: 'Морось',
        55: 'Сильная морось',
        56: 'Ледяная морось',
        57: 'Сильная ледяная морось',
        61: 'Небольшой дождь',
        63: 'Дождь',
        65: 'Сильный дождь',
        66: 'Ледяной дождь',
        67: 'Сильный ледяной дождь',
        71: 'Небольшой снег',
        73: 'Снег',
        75: 'Сильный снег',
        77: 'Снежные зерна',
        80: 'Небольшой ливень',
        81: 'Ливень',
        82: 'Сильный ливень',
        85: 'Небольшой снегопад',
        86: 'Снегопад',
        95: 'Гроза',
        96: 'Гроза с градом',
        99: 'Сильная гроза с градом'
    };

    return descriptions[code] || 'Неизвестные условия';
}